run/tutorials/heatTransfer/buoyantPimpleFoam/hotRoomWithThermalShell.multi-area/system/finite-area/ceiling/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(jouleHeatingSource:V) Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         none;
    laplacian((hs*jouleHeatingSource:sigma),jouleHeatingSource:V) Gauss linear corrected;
    laplacian((kappas*hs),Ts) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

lnGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
